# Desafio 1

Para esse desafio, vamos trabalhar com o data set [Black Friday](https://www.kaggle.com/mehdidag/black-friday), que reúne dados sobre transações de compras em uma loja de varejo.

Vamos utilizá-lo para praticar a exploração de data sets utilizando pandas. Você pode fazer toda análise neste mesmo notebook, mas as resposta devem estar nos locais indicados.

> Obs.: Por favor, não modifique o nome das funções de resposta.

## _Set up_ da análise

In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.read_csv("black_friday.csv")

## Inicie sua análise a partir daqui

In [4]:
df.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200
2,1000001,P00087842,F,0-17,10,A,2,0,12,NaN,NaN,1422
3,1000001,P00085442,F,0-17,10,A,2,0,12,14.0,NaN,1057
4,1000002,P00285442,M,55+,16,C,4+,0,8,NaN,NaN,7969

In [5]:
df.columns

Index(['User_ID', 'Product_ID', 'Gender', 'Age', 'Occupation', 'City_Category',
       'Stay_In_Current_City_Years', 'Marital_Status', 'Product_Category_1',
       'Product_Category_2', 'Product_Category_3', 'Purchase'],
      dtype='object')

In [6]:
df.shape

(537577, 12)

In [7]:
df.info

<bound method DataFrame.info of         User_ID Product_ID Gender    Age  Occupation City_Category  \
0       1000001  P00069042      F   0-17          10             A
1       1000001  P00248942      F   0-17          10             A
2       1000001  P00087842      F   0-17          10             A
3       1000001  P00085442      F   0-17          10             A
4       1000002  P00285442      M    55+          16             C
...         ...        ...    ...    ...         ...           ...
537572  1004737  P00193542      M  36-45          16             C
537573  1004737  P00111142      M  36-45          16             C
537574  1004737  P00345942      M  36-45          16             C
537575  1004737  P00285842      M  36-45          16             C
537576  1004737  P00118242      M  36-45          16             C

       Stay_In_Current_City_Years  Marital_Status  Product_Category_1  \
0                               2               0                   3
1                               2               0                   1
2                               2               0                  12
3                               2               0                  12
4                              4+               0                   8
...                           ...             ...                 ...
537572                          1               0                   1
537573                          1               0                   1
537574                          1               0                   8
537575                          1               0                   5
537576                          1               0                   5

        Product_Category_2  Product_Category_3  Purchase
0                      NaN                 NaN      8370
1                      6.0                14.0     15200
2                      NaN                 NaN      1422
3                     14.0                 NaN      1057
4                      NaN                 NaN      7969
...                    ...                 ...       ...
537572                 2.0                 NaN     11664
537573                15.0                16.0     19196
537574                15.0                 NaN      8043
537575                 NaN                 NaN      7172
537576                 8.0                 NaN      6875

[537577 rows x 12 columns]>

In [8]:
info = pd.DataFrame({'colunas': df.columns, 'dtypes' : df.dtypes, 'missing' : df.isna().sum() ,'missing%' : df.isna().sum()/df.shape[0]})

In [9]:
info

,colunas,dtypes,missing,missing%
User_ID,User_ID,int64,0,0.000000
Product_ID,Product_ID,object,0,0.000000
Gender,Gender,object,0,0.000000
Age,Age,object,0,0.000000
Occupation,Occupation,int64,0,0.000000
City_Category,City_Category,object,0,0.000000
Stay_In_Current_City_Years,Stay_In_Current_City_Years,object,0,0.000000
Marital_Status,Marital_Status,int64,0,0.000000
Product_Category_1,Product_Category_1,int64,0,0.000000
Product_Category_2,Product_Category_2,float64,166986,0.310627
Product_Category_3,Product_Category_3,float64,373299,0.694410
Purchase,Purchase,int64,0,0.000000

In [10]:
df.nunique()

User_ID                        5891
Product_ID                     3623
Gender                            2
Age                               7
Occupation                       21
City_Category                     3
Stay_In_Current_City_Years        5
Marital_Status                    2
Product_Category_1               18
Product_Category_2               17
Product_Category_3               15
Purchase                      17959
dtype: int64

In [11]:
df.groupby('Age')['Gender'].value_counts()

Age    Gender
0-17   M           9754
       F           4953
18-25  M          73577
       F          24057
26-35  M         165342
       F          49348
36-45  M          81079
       F          26420
46-50  M          31670
       F          12856
51-55  M          27984
       F           9634
55+    M          15974
       F           4929
Name: Gender, dtype: int64

In [12]:
df_F= df[df['Gender']=='F']
df_F_26_35=df_F[df_F['Age']=='26-35']

df_F_26_35.shape[0]

49348

In [13]:
df.isna().max(axis=1).sum()/df.shape[0]

0.6944102891306734

In [14]:
df.isna().sum().max()

373299

In [15]:
df['Product_Category_3'][df['Product_Category_3'].notna()].mode()[0]

16.0

## PADRONIZAÇÃO E NORMALIZAÇÃO PURCHASE

In [16]:
mean = df.Purchase.mean()
std = df.Purchase.std()

In [17]:
df['Purchase_P'] = (df['Purchase'] - mean)/std

In [19]:
df['Purchase_N'] = (df.Purchase - df.Purchase.min())/(df.Purchase.max()-df.Purchase.min())

In [21]:
a8=df.Purchase_N.mean()

In [18]:
a9=df['Purchase_P'][df['Purchase_P']<=1][df['Purchase_P']>=-1].shape[0]

In [19]:
df[df['Product_Category_2'].isna()].shape[0]

166986

In [20]:
df[df['Product_Category_2'].isna()][df['Product_Category_3'].isna()].shape[0]

<ipython-input-20-b272c5ce18d8>:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  df[df['Product_Category_2'].isna()][df['Product_Category_3'].isna()].shape[0]

166986

In [21]:
df[df['Product_Category_2'].isna()].shape[0] == df[df['Product_Category_2'].isna()][df['Product_Category_3'].isna()].shape[0]

<ipython-input-21-8e4c5e6b553e>:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  df[df['Product_Category_2'].isna()].shape[0] == df[df['Product_Category_2'].isna()][df['Product_Category_3'].isna()].shape[0]

True

## Questão 1

Quantas observações e quantas colunas há no dataset? Responda no formato de uma tuple `(n_observacoes, n_colunas)`.

In [22]:
def q1():
    # Retorne aqui o resultado da questão 1.
    a1 = (537577, 12)
    return a1

## Questão 2

Há quantas mulheres com idade entre 26 e 35 anos no dataset? Responda como um único escalar.

In [23]:
def q2():
    # Retorne aqui o resultado da questão 2.
    a2 = df_F_26_35.shape[0]
    return a2

## Questão 3

Quantos usuários únicos há no dataset? Responda como um único escalar.

In [24]:
def q3():
    # Retorne aqui o resultado da questão 3.
    return df['User_ID'].nunique()

## Questão 4

Quantos tipos de dados diferentes existem no dataset? Responda como um único escalar.

In [25]:
def q4():
    # Retorne aqui o resultado da questão 4.
    return info['dtypes'].nunique()

## Questão 5

Qual porcentagem dos registros possui ao menos um valor null (`None`, `ǸaN` etc)? Responda como um único escalar entre 0 e 1.

In [26]:
def q5():
    # Retorne aqui o resultado da questão 5.
    return 0.694410

## Questão 6

Quantos valores null existem na variável (coluna) com o maior número de null? Responda como um único escalar.

In [27]:
def q6():
    # Retorne aqui o resultado da questão 6.
    return 373299

## Questão 7

Qual o valor mais frequente (sem contar nulls) em `Product_Category_3`? Responda como um único escalar.

In [28]:
def q7():
    # Retorne aqui o resultado da questão 7.
    return df['Product_Category_3'][df['Product_Category_3'].notna()].mode()[0]

## Questão 8

Qual a nova média da variável (coluna) `Purchase` após sua normalização? Responda como um único escalar.

In [29]:
def q8():
    # Retorne aqui o resultado da questão 8.
    return a8

## Questão 9

Quantas ocorrências entre -1 e 1 inclusive existem da variáel `Purchase` após sua padronização? Responda como um único escalar.

In [30]:
def q9():
    # Retorne aqui o resultado da questão 9.
    return a9

## Questão 10

Podemos afirmar que se uma observação é null em `Product_Category_2` ela também o é em `Product_Category_3`? Responda com um bool (`True`, `False`).

In [31]:
def q10():
    # Retorne aqui o resultado da questão 10.
    return df[df['Product_Category_2'].isna()].shape[0] == df[df['Product_Category_2'].isna()][df['Product_Category_3'].isna()].shape[0]